package gr.cti.eslate.base;

import java.util.*;

/**
 * Greek language localized strings for the E-Slate base classes.
 *
 * @author      Kriton Kyrimis
 * @version     2.0.23, 23-Jan-2008
 */
public class ESlateResource_el extends ListResourceBundle
{
  public Object[][] getContents()
  {
    return contents;
  }

  static final Object[][] contents = {
    //
    // Resources for ESlateMicroworld
    //
    {"componentName", "Μικρόκοσμος"},
    {"credits1", "Τμήμα του περιβάλλοντος Αβάκιο (http://E-Slate.cti.gr)"},
    {"credits2", "Ανάπτυξη: Κ. Κυρίμης"},
    {"credits3", "Copyright Ερευνητικό Ακαδημαϊκό Ινστιτούτο Τεχνολογίας Υπολογιστών-ΕΑ.ΙΤΥ 1993-2008.\nΑνάπτυξη τρέχουσας έκδοσης από τις Conceptum AE και ΕΧΟDUS AE.\nΤο Αβάκιο 2.0 υπόκειται σε διπλή άδεια (dual license), ήτοι ισχύουν οι όροι  της GNU-GPL License και της  L-GPL license.\n\nΕπιτρέπεται η παραγωγή, διανομή και εμπορική εκμετάλλευση κλειστού ή ανοιχτού κώδικα παράγωγων προϊόντων\nβασισμένων στην πλατφόρμα Αβάκιο 2.0 και κάθε επόμενης έκδοσής της καθώς επίσης και να συμπεριλαμβάνεται\nκαι να διανέμεται μαζί με τα προϊόντα αυτά η πλατφόρμα σε μορφή πηγαίου ή/και εκτελέσιμου κώδικα."},
    {"version", "έκδοση"},
    {"notSelf", "Οι σύνδεσμοι δεν μπορούν να συνδεθούν με τον εαυτό τους"},
    {"singleConnected1", "Ο σύνδεσμος \""},
    {"singleConnected2", "\" είναι ήδη συνδεδεμένος.\nΔεν επιτρέπονται παραπάνω από μία συνδέσεις σε αυτού του τύπου τον σύνδεσμο."},
    {"noProtocolDefined", "Δεν έχει ορισθεί πρωτόκολλο ανάμεσα στους δύο συνδέσμους"},
    {"incompatible1", "Οι σύνδεσμοι έχουν τύπους που δεν ταιριάζουν και δεν μπορούν να συνδεθούν."},
    {"incompatible2", "Συνδέστε μεταξύ τους συνδέσμους με το ίδιο χρώμα και αντίστοιχες εσοχές/εξοχές."},
    {"noShobjEither", "Καμμία από τις δύο ψηφίδες δεν παρέχει διαμοιραζόμενο αντικείμενο"},
    {"cantOpen1", "Το αρχείο "},
    {"cantOpen2", " δεν μπορεί να ανοιχθεί"},
    {"cantCreate1", "Το αρχείο "},
    {"cantCreate2", " δεν μπορεί να δημιουργηθεί"},
    {"loadPage", "Ανάγνωση σελίδας"},
    {"savePage", "Αποθήκευση σελίδας"},
    {"saveFailed", "Η αποθήκευση απέτυχε"},
    {"notArchive", "Το αρχείο αυτό δεν περιέχει αποθηκευμένη σελίδα"},
    {"badVersion", "Ασύμβατη έκδοση αρχείου"},
    {"required1", "--απαιτείται η έκδοση"},
    {"required2", ""},
    {"loadFailed", "Η ανάγνωση απέτυχε"},
    {"notThis", "Το αρχείο αυτό δεν περιέχει τα σωσμένα περιεχόμενα αυτής της σελίδας"},
    {"component", "Η ψηφίδα"},
    {"dontHavePlug", "δεν έχει σύνδεσμο με εσωτερικό όνομα"},
    {"sltDesc", "Αποθηκευμένες σελίδες"},
    {"open", "Ανάγνωση"},
    {"save", "Αποθήκευση"},
    {"plugView", "Διαχείριση συνδέσμων"},
    {"loadingPage", "Ανάγνωση σελίδας"},
    {"loadingPleaseWait", "Ανάγνωση σελίδας--παρακαλώ περιμένετε"},
    {"savingPage", "Αποθήκευση σελίδας"},
    {"savingPleaseWait", "Αποθήκευση σελίδας--παρακαλώ περιμένετε"},
    {"loading", "Ανάγνωση σελίδας..."},
    {"saving", "Αποθήκευση σελίδας..."},
    {"pleaseWait", "Παρακαλώ περιμένετε"},
    {"nullOldName", "Το παλιό όνομα είναι null"},
    {"nullNewName", "Το νέο όνομα είναι null"},
    {"noSuchComponent", "Δεν υπάρχει ψηφίδα με όνομα"},
    {"microworldNameUsed", "Το όνομα αυτό χρησιμοποιείται από άλλο μικρόκοσμο"},
    {"microworld", "Μικρόκοσμος"},
    {"defaultMicroworldName", "-=+*Μικρόκοσμος*+=-"},
    {"folderNotExist1", "Ο κατάλογος "},
    {"folderNotExist2", " δεν υπάρχει"},
    {"folderNotDir1", "Το αρχείο "},
    {"folderNotDir2", " δεν είναι κατάλογος"},
    {"cantDeleteInfo", "Δεν μπορούν να διαγραφούν οι πληροφορίες για τις ψηφίδες από το αρχείο του μικροκοσμου"},
    {"notOpenLoad", "Δεν είναι ανοικτό το αρχείο του μικροκόσμου για ανάγνωση"},
    {"notOpenSave", "Δεν είναι ανοικτό το αρχείο του μικροκόσμου για γράψιμο"},
    {"notExtSerializable", "Η ψηφίδα δεν είναι ούτε Externalizable ούτε Serializable"},
    {"connectSound", "connect.wav"},
    {"disconnectSound", "disconnect.au"},
    {"cantconnectSound", "cantconnect.wav"},
    {"failedToLoad", "Δεν στάθηκε δυνατή η αποκατάσταση της καταστάσεως των παρακάτω ψηφίδων:"},
    {"failedToSave", "Δεν στάθηκε δυνατή η αποθήκευση της καταστάσεως των παρακάτω ψηφίδων:"},
    {"failedToConnect", "Κατά την επανασύνδεση των ψηφίδων παρουσιάστηκαν τα ακόλουθα προβλήματα:"},
    {"restoringState", "Ανάγνωση καταστάσεως μικροκόσμου"},
    {"restoringComponentState", "Ανάγνωση καταστάσεως ψηφίδας"},
    {"restoringConnections", "Αποκατάσταση συνδέσμων"},
    {"savingState", "Αποθήκευση κατάστάσεως μικροκόσμου"},
    {"savingComponentState", "Αποθήκευση καταστάσεως ψηφίδας"},
    {"copyComponentData", "Αντιγραφή δεδομένων ψηφίδων"},
    {"deleteRedundantComponentData", "Διαγραφή περιττών δεδομένων ψηφίδων"},
    {"noTarget", "Δεν έχει ορισθεί η τελική ψηφίδα"},
    {"noTarget2", "Ο τελικός σύνδεσμος δεν ανήκει σε καμία ψηφίδα"},
    {"noOrig", "Δεν έχει ορισθεί η αρχική ψηφίδα"},
    {"noOrigPlug", "Δεν έχει ορισθεί ο αρχικός σύνδεσμος"},
//    {"noOrigPlug2", "Η αρχική ψηφίδα δεν έχει τέτοι σύνδεσμο"},
    {"notInMW", "δεν υπάρχει σ' αυτό το μικρόκοσμο"},
    {"noHandle", "Ένας από τους δύο συνδέσμους δεν ανήκει σε κάποια ψηφίδα"},
    {"differentMicroworlds", "Οι σύνδεσμοι ανήκουν σε διαφορετικούς μικροκόσμους και δεν μπορούν να συνδεθούν"},
    {"noKey", "Δεν δόθηκε κλειδί"},
    {"badKey", "Το κλειδί που δόθηκε είναι λάθος"},
    {"fromESlateHandle", "Αυτή η μέθοδος μπορεί να κληθεί μόνο από την κλάση ESlateHandle"},
    {"selectDirToEditHelp", "Ορίστε τον κατάλογο όπου θα εξαχθούν τα αρχεία βοηθείας"},
    {"editAndHitOK1", "Τροποποιήστε τα αρχεία στον κατάλογο "},
    {"editAndHitOK2", " και πατήστε \"Εντάξει\""},
    {"editHelp", "Τροποποιήστε τα αρχεία βοηθείας"},
    {"removeHelpDir1", "Να διαγραφεί ο κατάλογος "},
    {"removeHelpDir2", ";"},
    {"removeHelp", "Διαγραφή προσωρινών αρχείων"},
    //
    // Resources for ESlateHandle
    //
    {"error", "Σφάλμα"},
    {"showPlugs", "Εμφάνιση συνδέσμων"},
    {"help", "Βοήθεια"},
    {"about", "Περί αυτής της ψηφίδος"},
    {"nullPlug", "Ο σύνδεσμος είναι null"},
    {"aTopPlugNamed", "Ένας σύνδεσμος πρώτου επιπέδου με όνομα"},
    {"aTopPlugInternallyNamed", "Ένας σύνδεσμος πρώτου επιπέδου με εσωτερικό όνομα"},
    {"alreadyAttached", "είναι ήδη προσκολλημένος σ' αυτήν την ψηφίδα"},
    {"doesntHavePlug", "Αυτή η ψηφίδα δεν έχει σύνδεσμο με όνομα"},
    {"nameUsed1", "Το όνομα "},
    {"nameUsed2", " χρησιμοποιείται από άλλη ψηφίδα"},
    {"noHelp", "Δεν υπαρχει διαθέσιμη βοήθεια γι' αυτήν την ψηφίδα"},
    {"noHelpSystem", "Το σύστημα βοηθείας δεν είναι διαθέσιμο"},
    {"noInfo", "Δεν υπαρχoυν πληροφορίες γι' αυτήν την ψηφίδα"},
    {"helpFor", "Βοήθεια για την ψηφίδα"},
    {"nullMicroworld", "Ο μικρόκοσμος δεν πρέπει να είναι null"},
    {"renamingForbidden", "Η αλλαγή ονόματος των ψηφίδων δεν επιτρέπεται αυτή τη στιγμή"},
    {"renamingForbiddenHere", "Η αλλαγή τού ονόματος αυτής της ψηφίδας δεν επιτρέπεται αυτή τη στιγμή"},
    {"renamingMWForbidden", "Η αλλαγή τού ονόματος του μικροκόσμου δεν επιτρέπεται αυτή τη στιγμή"},
    {"nullName", "Το όνομα της ψηφίδας δεν μπορεί να είναι κενό ή null"},
    {"cantContain1", "Μη αποδεκτό όνομα \""},
    {"cantContain2", "\"-τα ονόματα δεν επιτρέπεται να περιέχουν τον χαρακτήρα \""},
    {"cantContain3", "\""},
    {"nullHandle", "Το handle δεν πρέπει να είναι κενό"},
    {"reparentQuery1", "Η ψηφίδα"},
    {"reparentQuery2", "αφαιρέθηκε από το γονέα της."},
    {"reparentQuery3", "Θέλετε να την καταστρέψετε ή να τη μεταφέρετε σε μια από τις ακόλουθες ψηφίδες;"},
    {"reparentOK", "Μεταφορά"},
    {"reparentCancel", "Καταστροφή"},
    {"query", "Ερώτηση"},
    {"noMicroworldFile", "Δεν είναι ανοικτό κανένα αρχείο μικροκόσμου"},
    {"needMWToUnpack", "Η ψηφίδα αυτή χρειάζεται να γράψη δικά της αρχεία στο αρχείο τού μικροκόσμου, αλλά δεν είναι ανοικτό κανένα αρχείο μικροκόσμου"},
    {"compoNullName", "[Ψηφίδα με κενό όνομα]"},
    //
    // Resources for Plug
    //
    {"noListener", "Ο shared object listener είναι null"},
    {"noSharedObject", "Δεν έχει ορισθεί κλάση διαμοιραζομένου αντικειμένου"},
    {"class", "Η κλάση"},
    {"notShobjSubClass", "δεν είναι υποκλάση της κλάσεως SharedObject"},
    {"nullProtocol", "Το πρωτόκολλο που δόθηκε είναι κενό"},
    {"notInterface", "δεν είναι Java interface"},
    {"noComponent", "Καμμία ψηφίδα δεν είναι συνδεδεμένη σ' αυτόν τον σύνδεσμο μέσω του μηχανισμού πρωτοκόλλου"},
    {"manyComponents", "Περισσότερες από μία ψηφίδες είναι συνδεδεμένες σ' αυτόν τον σύνδεσμο μέσω του μηχανισμού πρωτοκόλλου"},
    {"aPlugNamed", "Ένας σύνδεσμος με όνομα"},
    {"aPlugInternallyNamed", "Ένας σύνδεσμος με εσωτερικό όνομα"},
    {"alreadyAttachedToPlug", "είναι ήδη προσκολλημένος σ' αυτόν τον σύνδεσμο"},
    {"noSubPlug", "Αυτός ο σύνδεσμος δεν έχει υποσύνδεσμο με όνομα"},
    {"plug", "Ο σύνδεσμος"},
    {"notConnected", "δεν είναι συνδεδεμένος σ'αυτόν τον σύνδεσμο"}, 
    {"notConnectedToInput", "δεν είναι συνδεδεμένος στο τμήμα εισόδου αυτού του συνδέσμου"},
    {"notConnectedToOutput", "δεν είναι συνδεδεμένος στο τμήμα εξόδου αυτού του συνδέσμου"},
    {"cantConnect1", "Ο σύνδεσμος "},
    {"cantConnect2", " δεν μπορεί να συνδεθεί στο σύνδεσμο "},
    {"onlyIO", "Μόνον το τμήμα εισόδου ή εξόδου ενός συνδέσμου μπορεί να αποσυνδεθεί"},
    {"badRole", "Λανθασμένος προσδιορισμός ρόλου"},
    {"noImplementor", "Ο σύνδεσμος δεν έχει υλοποιητή πρωτοκόλλου"},
    {"nullInterface", "Το interface που δόθηκε είναι κενό"},
    {"notImplements", "Ο υλοποιητής πρωτοκόλλου δεν υλοποιεί το interface"},
    {"nullKey", "Το resource bundle key δεν πρέπει να είναι null"},
    {"badShObj", "Το διαμοιραζόμενο αντικείμενο ανήκει σε λκάθος κλάση"},
    //
    // Resources for MasterControl
    //
    {"MCcomponentName", "Ψηφίδα Κεντρικός Έλεγχος"},
    {"MCname", "Κεντρικός_Έλεγχος"},
    {"part", "Τμήμα της πλατφόρμας \"Αβάκιο\" (http://E-Slate.cti.gr/)"},
    {"design", "Σχεδιασμός & ανάπτυξη: Κ. Κυρίμης (1998-2000)"},
    {"funding", "Χρηματοδότηση: Έργο \"IMEL\" (EC DGXXII, Socrates 25136-CP-1-96-1-GR-ODL)"},
    {"copyright", "© Ινστιτούτο Τεχνολογίας Υπολογιστών"},
    {"version", "έκδοση"},
    {"MChelpfile", "help/mastercontrol_el.html"},
    //
    // Resources for Console
    //
    {"CcomponentName", "Ψηφίδα Κονσόλα"},
    {"Cname", "Κονσόλα"},
    {"Chelpfile", "help/console_el.html"},
    {"saveText", "Αποθήκευση κειμένου"},
    {"copyText", "Αντιγραφή κειμένου"},
    {"clearText", "Διαγραφή κειμένου"},
    {"logDesc", "Μηνύματα κονσόλας"},
    //
    // Resources for EORReachedException
    //
    {"eorText", "Η ψηφίδα προσπάθησε να διαβάση περισσότερα δεδομένα απ' όσα είναι διαθέσιμα"},
    //
    // Resources for PlugViewDesktopPane
    //
    {"noActive", "Καμία ενεργή ψηφίδα"},
    {"order", "Τακτοποίηση"},
    //
    // Resources for PlugViewDesktop
    //
    {"prefs", "Προτιμήσεις"},
    {"resizeFrames", "Αυτόματη ρύθμιση μεγέθους πλαισίων"},
    {"showExist", "Φώτισμα υπαρχουσών συνδέσεων"},
    {"showNew", "Φώτισμα δυνατών συνδέσεων"},
    {"autoOpen", "Αυτόματο άνοιγμα κόμβων"},
    {"delayedAutoOpen", "Αυτόματο άνοιγμα κόμβων με καθυστέρηση"},
    {"autoOpenCompatible", "Αυτόματο άνοιγμα συμβατών κόμβων"},
    {"tools", "Εργαλεία"},
    {"edit", "Αλλαγές"},
    {"undoConnect", "Ακύρωση σύνδεσης συνδέσμου "},
    {"redoConnect", "Επανάληψη σύνδεσης συνδέσμου "},
    {"undoDisconnect", "Ακύρωση αποσύνδεσης συνδέσμου "},
    {"redoDisconnect", "Επανάληψη αποσύνδεσης συνδέσμου "},
    {"fromPlug", " από το σύνδεσμο "},
    {"toPlug", " στο σύνδεσμο "},
    {"undo", "Ακύρωση"},
    {"redo", "Επανάληψη"},
    //
    // Resources for PlugViewFrame
    //
    {"disconnect", "Αποσύνδεση"},
    {"disconnectAllplugs", "Από όλες τις ψηφίδες"},
    {"fromPlug", "Συνδέσμου"},
    {"ofComponent", "της ψηφίδας"},
    {"confirm", "Επιβεβαίωση"},
    {"confirmDisconnect1", "Είστε βέβαιοι ότι θέλετε να αποσυνδεσετε το σύνδεσμο"},
    {"confirmDisconnect2", "από όλες τις ψηφίδες;"},
    {"confirmDisconnect3", "από το σύνδεσμο"},
    {"confirmDisconnect4", "της ψηφίδας"},
    {"confirmDisconnect5", ";"}
  };
}
