package gr.cti.eslate.mapViewer;

import java.util.ListResourceBundle;

/**
 * Messages Bundle.
 * <P>
 *
 * @author	Giorgos Vasiliou
 * @version	3.0.0, 17-Nov-1999
 */
 public class MessagesBundle_el_GR extends ListResourceBundle {
	public Object [][] getContents() {
		return contents;
	}

	static final Object[][] contents={
		{"componentname",   "Προβολέας χαρτών"},
		{"wrongtitle",      "Κάτι δεν πήγε καλά!"},
		{"cantconnect",     "Δεν είναι δυνατή η σύνδεση με το χάρτη. Πιθανό σφάλμα."},
		{"mapscale",        "Κλίμακα"},
		{"unknown",         "  "},
		{"rotation",        "Περιστροφή:"},
		{"degrees",         "μοίρες"},
		{"zoom",            "Προβολή:"},
		{"mapspot",         "Η θέση της περιοχής στον ευρύτερο χάρτη"},
		{"distance",        "Η απόσταση είναι"},
		{"km",              "χλμ."},
		{"m",               "μ"},
		{"and",             "και"},
		{"chooselayer",     "Δώσε το επίπεδο στο οποίο θα εισαχθεί το αντικείμενο:"},
		{"alwaysinsert",    "Έισαγωγή πάντα με αυτές τις ρυθμίσεις."},
		{"alwaysinsertinfo","(Για να αλλάξετε τις ρυθμίσεις πατήστε το δεξί κουμπί του ποντικιού για την εισαγωγή ενός αντικειμένου)"},
		{"defineicon",      "Όρισε το εικονίδιο που θα χρησιμοποιηθεί:"},
		{"newicon",         "Ορισμός"},
		{"newlayer",        "Νέο"},
		{"ok",              "Εντάξει"},
		{"cancel",          "Άκυρο"},
		{"cannotaddobject", "Δεν είναι δυνατή η εισαγωγή του αντικειμένου!"},
		{"noname",          "Πρέπει να δωθεί όνομα στο επίπεδο."},
		{"givelayername",   "Όνομα νέου επιπέδου αντικειμένων:"},
		{"defaultlayername","Τα αντικείμενά μου"},
		{"showinallregions","Το επίπεδο θα φαίνεται σε όλες τις περιοχές."},
		{"showinthisregion","Το επίπεδο θα φαίνεται μόνο στην τρέχουσα περιοχή."},
		{"field",           "Πεδίο"},
		{"promptnewlayer",  "Δεν έχεις καθορίσει επίπεδο στην οποία θα εισαχθεί το αντικείμενο.\nΜπορείς να ορίσεις μία τώρα."},
		{"cannotremoveobject","Δεν είναι δυνατή η διαγραφή του αντικειμένου! Το αντικείμενο τοποθετήθηκε στην αρχική του θέση."},
		{"cannoteditobject","Δεν μπορεί να γίνει η αλλαγή που ζητήσατε στο αντικείμενο!"},
		{"agentnotpositioned",  "Η οντότητα αυτή δεν έχει τοποθετηθεί, δεν γνωρίζει δηλαδή που να σταθεί στο χάρτη.\nΠαρακαλώ καθορίστε με το ποντίκι τη θέση της οντότητας με κλικ πάνω στο χάρτη.\nΑυτή η οντότητα μπορεί να σταθεί στα σημεία που ο δείκτης του ποντικιού γίνεται σταυρός.\n(Αν ο δείκτης πάνω στο χάρτη είναι ο απλός δείκτης ποντικιού, κάντε κλικ μία φορά για να τον ενεργοποιήσετε)"},
		{"agentnotconnected","Η οντότητα αρνείται να αποδεχτεί τη θέση που καθορίσατε."},
		{"agentcantconnect","Η οντότητα δεν μπορεί να συνδεθεί με αυτό το χάρτη.\nΊσως ο χάρτης να μην έχει νόμιμο σύστημα συντεταγμένων."},
		{"requestedlayernotpresent","Η οντότητα απαιτεί από το χάρτη πληροφορίες τις οποίες δεν διαθέτει. Δοκίμασε να τοποθετήσεις την οντότητα σε άλλο χάρτη ή επανόρισε το χάρτη."},
		{"askpositionagent","Η οντότητα απαιτεί από το χάρτη πληροφορίες τις οποίες δεν διαθέτει. Παρ'όλα αυτά έχει νόμιμη θέση.\nΘέλεις να εμφανιστεί η οντότητα στο χάρτη;"},
		{"agentpath",       "Διαδρομή"},
		{"embark",          "Δείτε λίστα των οντοτήτων που μπορεί να επιβιβαστεί."},
		{"disembark",       "Αποβιβάσετε οποιαδήποτε οντότητα."},
		{"close",           "Κλείσιμο"},
		{"clearicon",       "Καθαρισμός"},
		{"scrollpan",       "Μεταφορά στη γειτονική περιοχή"},
		//Legend
		{"leg.legend",          "Υπόμνημα"},
		{"leg.layers",          "Επίπεδα"},
		{"leg.backgrounds",     "Υπόβαθρα"},
		{"leg.paths",           "Διαδρομές"},
		{"leg.lamptip",         "Εμφάνιση/Απόκρυψη επιπέδου"},
		{"leg.lampagenttip",    "Εμφάνιση/Απόκρυψη μονοπατιού"},
		{"leg.dragtip",         "Σύρε προς τα πάνω ή κάτω για ανακατάταξη των επιπέδων"},
		{"leg.dragagenttip",    "Σύρε προς τα πάνω ή κάτω για ανακατάταξη των μονοπατιών"},
		{"leg.pointdraw",       "Σημειακό επίπεδο"},
		{"leg.pointicon",       "Σημειακό επίπεδο με εικονίδιο"},
		{"leg.pointmultipleicon","Σημειακό επίπεδο με διάφορα εικονίδια"},
		{"leg.linedraw",        "Επίπεδο γραμμών"},
		{"leg.polygondraw",     "Επίπεδο πολυγώνων"},

		{"zoom.value",          "Αλλαγή τιμής μεγέθυνσης..."},
		{"zoom.fifty",          "50%"},
		{"zoom.hundred",        "100%"},
		{"zoom.twohundred",     "200%"},
		{"zoom.fivehundred",    "500%"},
		{"zoom.gvvalue",        "Όρισε νέο ποσοστό μεγέθυνσης"},
		{"zoom.min",            "Αλλαγή ελάχιστης τιμής μεγέθυνσης..."},
		{"zoom.gvmin",          "Όρισε το ελάχιστο ποσοστό μεγέθυνσης"},
		{"zoom.max",            "Αλλαγή μέγιστης τιμής μεγέθυνσης..."},
		{"zoom.gvmax",          "Όρισε το μέγιστο ποσοστό μεγέθυνσης"},

		{"LoadTimer",             "Ανάκτηση προβολέα χαρτών"},
		{"SaveTimer",             "Αποθήκευση προβολέα χαρτών"},
		{"ConstructorTimer",      "Κατασκευή Προβολέα Χαρτών"},
		{"InitESlateAspectTimer", "Κατασκευή αβακιακής πλευράς Προβολέα Χαρτών"},
		{"ActiveRegionChanged",     "Αλλαγή περιοχής"},
		{"FullMapRedraw",           "Πλήρες ζωγράφισμα επιπέδων χάρτη"},
		{"PartialMapRedraw",        "Κατά περιοχές ζωγράφισμα επιπέδων χάρτη"},
		{"FullLabelRedraw",         "Πλήρες ζωγράφισμα ετικετών"},
		{"PartialLabelRedraw",      "Κατά περιοχές ζωγράφισμα ετικετών"},
		{"GetLayersFromModel",      "Ανάγνωση επιπέδου από μοντέλο"},
		{"GetBackgroundFromModel",  "Ανάγνωση εικόνας υποβάθρου από μοντέλο"},
	};
}
