package gr.cti.eslate.canvas;

import java.util.ListResourceBundle;

/**
 * @version     2.0.4, 23-Jan-2008
 * @author      George Birbilis
 * @author      Kriton Kyrimis
 */
public class MessagesBundle_el_GR extends ListResourceBundle {
    public Object [][] getContents() {
        return contents;
    }

    static final String[] info={"Τμήμα του περιβάλλοντος Αβάκιο (http://E-Slate.cti.gr)",
                                "Ανάπτυξη: Γ. Μπιρμπίλης, Ν. Δρόσος, Κ. Κυρίμης",
                                "Συμβολή: Μ. Κουτλής, Χ. Κυνηγός, Α. Οικονόμου",
                                "Copyright Ερευνητικό Ακαδημαϊκό Ινστιτούτο Τεχνολογίας Υπολογιστών-ΕΑ.ΙΤΥ 1993-2008.",
                                "Ανάπτυξη τρέχουσας έκδοσης από τις Conceptum AE και ΕΧΟDUS AE.",
                                "Το Αβάκιο 2.0 υπόκειται σε διπλή άδεια (dual license), ήτοι ισχύουν οι όροι  της GNU-GPL License και της  L-GPL license.",
                                " ",
                                "Επιτρέπεται η παραγωγή, διανομή και εμπορική εκμετάλλευση κλειστού ή ανοιχτού κώδικα παράγωγων προϊόντων",
                                "βασισμένων στην πλατφόρμα Αβάκιο 2.0 και κάθε επόμενης έκδοσής της καθώς επίσης και να συμπεριλαμβάνεται",
                                "και να διανέμεται μαζί με τα προϊόντα αυτά η πλατφόρμα σε μορφή πηγαίου ή/και εκτελέσιμου κώδικα."
                               };

    static final Object[][] contents={
     {"info", info},
     //
     {"name", "Καμβάς"}, //8Jun2000: final name
     {"title",     "Ψηφίδα Καμβάς, έκδοση "},
     {"logopin",   "Εντολές Χελώνας"},
     {"colorpin",  "Χρώματα"},
     {"imagepin",  "Εικόνα"},
     {"turtlepin", "Χελώνες"},
     {"sliderpin", "Μεταβολέας"},
     //{"Μεταβολέας", "Μεταβολέας"},
     {"logocallinput", "Ειδοποίηση για εκτέλεση ρουτίνας LOGO"},
     //{"Ειδοποίηση για εκτέλεση ρουτίνας LOGO", "Ειδοποίηση για εκτέλεση ρουτίνας LOGO"},
     //
     {"New",   "Νέα σελίδα ζωγραφικής"},
     {"New Turtles' page", "Νέα σελίδα χελωνών"}, //14-1-1999
     {"Open",  "’νοιγμα εικόνας"}, //31-8-1999: έβαλα τόνο στο πρώτο "Α"
     {"Close", "Κλείσιμο σελίδας"},
     {"Save",  "Αποθήκευση εικόνας"},
     {"Print", "Εκτύπωση"},
     //
     {"Cut",   "Αποκοπή"},
     {"Copy",  "Αντιγραφή"},
     {"Paste", "Επικόλληση"},
     {"Clear", "Καθαρισμός"},
     {"Select All", "Επιλογή όλων"},
     {"Stamp","Σφραγίδα"}, //28-8-1998: Αλλαγή σε Σφραγίδα (αντί Σφραγγίδα)
     {"Font","Γραμματοσειρά"}, //19Aug1999
     //
     {"Hand","Χέρι"},
     {"Rubber","Γόμα"},
     {"Text","Κείμενο"},
     {"Fill","Γέμιση"},
     {"Pen","Μολύβι"},
     {"Line","Γραμμή"},
     {"Square","Τετράγωνο"}, //12-1-1999
     {"Rectangle","Παραλληλόγραμμο"},
     {"Circle","Κύκλος"},
     {"Oval","Ελλειψη"},
     {"Spray","Ψεκαστήρας"},
     {"Selection","Επιλογή περιοχής"},
     //
     {"ColorChooser","Επιλογή χρώματος"},
     {"TurtleLineChooser","Επιλογή γραμμής χελώνας"},
     {"CanonicalPolygon","Κανονικό πολύγωνο"},
     {"Music","Μουσική"}, //5-9-1998
     //
     {"Foreground Color","Χρώμα σχεδίασης"},
     {"Background Color","Χρώμα υποβάθρου"},
     {"Fill Color","Χρώμα γέμισης"},
     //
     {"Font","Γραμματοσειρά"},
     //
     {"File","Αρχείο"},     
     {"Edit","Επεξεργασία"}, //26-11-1998
     {"Tool","Εργαλείο"},
     {"Page","Στοίβα σελίδων"},
     {"Settings","Ρυθμίσεις"},
     //
     {"newpage","Ζωγραφική"}, //24-12-1998: changed value
     {"newturtlepage","Χελώνες"},
     {"warning","Προσοχή!!!"},
     {"lastchangesnotsaved","Οι τελευταίες σας αλλαγές δεν έχουν αποθηκευτεί ακόμη"},
     {"savefile","Να αποθηκεύσω το αρχείο"},
     {"questionmark",";"},
     //
     {"Filled Shapes","Γεμάτα σχήματα"},
     {"Opaque","Αδιαφανής"},
     {"Pen size","Μέγεθος μολυβιού"},
     {"Rubber size","Μέγεθος γόμας"},
     {"Tracks","Ιχνη"}, //18-1-1999
     //
     {"Give me the number of angles","Δώσε μου το πλήθος των γωνιών"}, //26-1-1999
     {"Give me the text","Δώσε μου το κείμενο"}, //26-1-1999
     {"Page name? ","Ονομα σελίδας; "}, //13-1-1999
     //
     {"OK","Εντάξει"},
     {"Cancel","’κυρο"},
     {"New page", "Νέα σελίδα"},
     {"Page's name :","Ονομα σελίδας :"},
     {"width (X) :","Πλάτος (Χ) :"},
     {"height (Y) :","Υψος (Ψ) :"}

   };
}
