package gr.cti.eslate.scripting.logo;

import java.util.ListResourceBundle;

public class DatabasePrimitivesBundle_en_US extends ListResourceBundle {
    public Object [][] getContents() {
        return contents;
    }

    static final Object[][] contents={
        {"DB.SETCELL",         "ΒΔ.�?�?ΣΕ�?ΕΛΛΙ"},
//        {"SETCELL",         "θκ"},
        {"DB.CELL",            "ΒΔ.�?ΕΛΛΙ"},
        {"DB.FIELD",           "ΒΔ.ΠΕΔΙ�?"},
        {"DB.RECORD",          "ΒΔ.ΕΓΓΡΑΦΗ"},
        {"DB.RECORDCOUNT",     "ΒΔ.ΑΡΙ�?�?�?ΣΕΓΓΡΑΦΩ�?"},
//        {"RECORDCOUNT",     "αεγγ"},
        {"DB.SETACTIVERECORD", "ΒΔ.�?ΕΣΕΕ�?ΕΡΓΗΕΓΓΡΑΦΗ"},
//        {"SETACTIVERECORD", "θεεγγ"},
        {"DB.ACTIVERECORD",    "ΒΔ.Ε�?ΕΡΓΗΕΓΓΡΑΦΗ"},
//        {"ACTIVERECORD",    "εεγγ"},
        {"DB.SELECTRECORDS",   "ΒΔ.ΕΠΕΛΕ�?ΕΕΓΓΡΑΦΕΣ"},
//        {"SELECTRECORDS",   "επεγγ�?"},
        {"DB.SELECTEDRECORDS", "ΒΔ.ΕΠΙΛΕΓ�?Ε�?ΕΣΕΓΓΡΑΦΕΣ"},
//        {"SELECTEDRECORDS", "επεγγ"},
        {"DB.SELECTEDRECORDCOUNT", "ΒΔ.ΑΡΙ�?�?�?ΣΕΠΙΛΕΓ�?Ε�?Ω�?ΕΓΓΡΑΦΩ�?"},
//        {"SELECTEDRECORDCOUNT", "αεεγγ"},
        {"DB.SELECT",          "ΒΔ.ΕΠΕΛΕ�?Ε"},
        {"DB.CLEARSELECTION",  "ΒΔ.�?Α�?ΑΡΙΣ�?�?ΣΕΠΙΛ�?ΓΗΣ"},
//        {"CLEARSELECTION",  "κεπ"},
        {"DB.INVERTSELECTION", "ΒΔ.Α�?ΤΙΣΤΡ�?ΦΗΕΠΙΛ�?ΓΗΣ"},
//        {"INVERTSELECTION", "αεπ"},
        {"DB.SELECTALL",       "ΒΔ.ΕΠΕΛΕ�?Ε�?ΛΑ"},
//        {"SELECTALL",       "επ�?λα"},
        {"DB.SFIELD",          "ΒΔ.ΕΠΕΔΙ�?"},
        {"DB.FIELDNAMES",      "ΒΔ.�?�?�?�?ΑΤΑΠΕΔΙΩ�?"},
//        {"FIELDNAMES",      "ονπεδ"},
        {"DB.DMIN",            "ΒΔ.�?Ι�?Ρ�?ΤΕΡ�?ΠΕΔΙ�?Υ"},
//        {"DMIN",            "μικ�?Πεδ"},
        {"DB.DMAX",            "ΒΔ.�?ΕΓΑΛΥΤΕΡ�?ΠΕΔΙ�?Υ"},
//        {"DMAX",            "μεγΠεδ"},
        {"DB.DSMALL",          "ΒΔ.�?Ι�?Ρ�?ΤΕΡ�?�?ΑΤΑΣΕΙΡΑ"},
//        {"DSMALL",          "μικκσ"},
        {"DB.DBIG",            "ΒΔ.�?ΕΓΑΛΥΤΕΡ�?�?ΑΤΑΣΕΙΡΑ"},
//        {"DBIG",            "μεγκσ"},
        {"DB.DRANK",           "ΒΔ.ΔΙΑΒΑ�?�?ΙΣ�?Ε�?�?�?ΑΤΑΣΕΙΡΑ"},
//        {"DRANK",           "διαβκσ"},
        {"DB.DSUM",            "ΒΔ.Α�?Ρ�?ΙΣ�?ΑΠΕΔΙ�?Υ"},
//        {"DSUM",            "αθ�?πεδ"},
        {"DB.DPRODUCT",        "ΒΔ.ΓΙ�?�?�?Ε�?�?ΠΕΔΙ�?Υ"},
//        {"DPRODUCT",        "γινπεδ"},
        {"DB.DAVERAGE",        "ΒΔ.�?ΕΣ�?Σ�?Ρ�?ΣΠΕΔΙ�?Υ"},
//        {"DAVERAGE",        "μεσπεδ"},
        {"DB.DGEOMEAN",        "ΒΔ.ΓΕΩ�?ΕΣ�?ΣΠΕΔΙ�?Υ"},
//        {"DGEOMEAN",        "γμεσπεδ"},
        {"DB.DCOUNT",          "ΒΔ.ΑΡΙ�?�?�?ΣΕ�?ΦΑ�?ΙΣΕΩ�?"},
//        {"DCOUNT",          "αεμφ"}
        {"DB.ADDRECORD",          "ΒΔ.ΠΡ�?Σ�?ΕΣΕΕΓΓΡΑΦΗ"},
        {"DB.CURTIME",          "ΒΔ.ΤΡΕΧΩ�?ΧΡ�?�?�?Σ"},
        {"DB.ADDITIONALLYSELECTRECORD",  "ΒΔ.ΕΠΕΛΕ�?ΕΕΠΙΠΛΕ�?�?ΕΓΓΡΑΦΗ"},
        {"DB.DVARIANCE",  "ΒΔ.ΔΙΑ�?Υ�?Α�?ΣΗ"},
        {"DB.DSTDEV",  "ΒΔ.ΤΥΠΙ�?ΗΑΠ�?�?ΛΙΣΗ"},
        {"DB.ACTIVETABLENAME", "ΒΔ.�?�?�?�?ΑΕ�?ΕΡΓ�?ΥΠΙ�?Α�?Α"},
        {"DB.ADDEMPTYRECORD", "ΒΔ.ΠΡ�?Σ�?ΕΣΕ�?Ε�?ΗΕΓΓΡΑΦΗ"},
        {"DB.ADDFIELD", "ΒΔ.ΠΡ�?Σ�?ΕΣΕΠΕΔΙ�?"},
        {"DB.ADDCALCULATEDFIELD", "ΒΔ.ΠΡ�?Σ�?ΕΣΕΥΠ�?Λ�?ΓΙΖ�?�?Ε�?�?ΠΕΔΙ�?"},
        {"DB.REMOVEFIELD", "ΒΔ.ΑΦΑΙΡΕΣΕΠΕΔΙ�?"},
        {"DB.REMOVERECORD", "ΒΔ.ΑΦΑΙΡΕΣΕΕΓΓΡΑΦΗ"},
        {"DB.SETTABLENAME", "ΒΔ.�?ΕΣΕ�?�?�?�?ΑΠΙ�?Α�?Α"},
        {"DB.SETFIELDEDITABLE", "ΒΔ.�?ΕΣΕΠΕΔΙ�?�?ΕΤΑΒΑΛΛ�?�?Ε�?�?"},
    };
}

