package gr.cti.eslate.clock;


import java.util.ListResourceBundle;


public class ClockBundleMessages_el_GR extends ListResourceBundle {
    public Object[][] getContents() {
        return contents;
    }

    static final Object[][] contents = {
            {"Time", "Ώρα"},
            {"Date", "Ημερομηνία"},
            {"Color", "Χρώμα"},
            {"tick", "Χρονισμός"},
            {"PM", "Μ.Μ."},
            {"AM", "Π.Μ."},
            {"componentName", "Ψηφίδα Ρολοι"},
            {"name", "Ρολόι"},
            {"E-Slate", "Αβάκιο"},
            {"part", "Τμήμα του περιβάλλοντος \"Αβάκιο\" (http://E-Slate.cti.gr/)"},
            {"development", "Ανάπτυξη : Θ. Μαντές, Κ.Κυρίμης"},
            {"copyright", "Copyright Ερευνητικό Ακαδημαϊκό Ινστιτούτο Τεχνολογίας Υπολογιστών-ΕΑ.ΙΤΥ 1993-2008.\nΑνάπτυξη τρέχουσας έκδοσης από τις Conceptum AE και ΕΧΟDUS AE.\nΤο Αβάκιο 2.0 υπόκειται σε διπλή άδεια (dual license), ήτοι ισχύουν οι όροι  της GNU-GPL License και της  L-GPL license.\n\nΕπιτρέπεται η παραγωγή, διανομή και εμπορική εκμετάλλευση κλειστού ή ανοιχτού κώδικα παράγωγων προϊόντων\nβασισμένων στην πλατφόρμα Αβάκιο 2.0 και κάθε επόμενης έκδοσής της καθώς επίσης και να συμπεριλαμβάνεται\nκαι να διανέμεται μαζί με τα προϊόντα αυτά η πλατφόρμα σε μορφή πηγαίου ή/και εκτελέσιμου κώδικα."},
            {"version", "Εκδοση"},

            {"hours", "Ένδειξη σε ώρες"},
            {"mins", "Ένδειξη σε λεπτά"},
            {"secs", "Ένδειξη σε δευτερόλεπτα"},

            //Bean Info
            {"Clock", "Ρολόι"},

            {"DateFormat", "Τρόπος απεικόνισης ημερομηνίας"},
            {"setDateFormatTip", "Ορίζει τον τροπο απεικονισης της ημερομηνίας"},

            {"SystemDate", "Ημερομηνία συστήματος"},
            {"setSystemDateTip", "Θέτει σαν ημερομηνια ρολογιού την ημερομηνία του συστήματος"},

            {"DateVisible", "Ενδειξη ημερομηνίας ορατή"},
            {"setDateVisibleTip", "Ορίζει αν η ημερομηνία θα φαίνεται στην αναλογική όψη του ρολογιού"},

            {"ShowHourNumbers", "Απεικόνιση αριθμών ωρών"},
            {"setShowHourNumbersTip", "Ορίζει αν θα απεικονίζονται οι αριθμοί των ωρών ή τα ενδεικτικά σημάδια"},

            {"ShowMinNumbers", "Απεικόνιση αριθμών λεπτών"},
            {"setShowMinNumbersTip", "Ορίζει αν θα απεικονίζονται οι αριθμοί των λεπτών ή τα ενδεικτικά σημάδια"},

            {"Background", "Χρώμα υποβάθρου"},
            {"setBackgroundTip", "Ορίζει το χρώμα του υποβάθρου"},

            {"DigitalReedingsFont", "Γραμματοσειρά ψηφιακού ρολογιού"},
            {"setDigitalReedingsFontTip", "Ορίζει τη γραμματοσειρα του ψηφιακού ρολογιού"},

            {"LogoTextFont", "Γραμματοσειρά αναλογικού ρολογιού"},
            {"setLogoTextFontTip", "Ορίζει τη γραμματοσειρα του αναλογικού ρολογιού"},

            {"Appearance", "Εμφάνιση (αναλογική/ψηφιακή)"},
            {"setAppearanceTip", "Ορίζει αν η εμφάνιση του ρολογιού θα ειναι αναλογική ή ψηφιακή"},

            {"SystemTimeCounting", "Ώρα συστήματος "},
            {"setSystemTimeCountingTip", "Το ρολόι δείχνει την ώρα του υπολογιστή "},

            {"BackgroundImageIcon", "Εικόνα υποβάθρου"},
            {"setBackgroundImageIconTip", "Ορίζει την εικόνα του υποβάθρου "},

            {"Text", " Κείμενο λογοτύπου (αναλογικη εμφάνιση)"},
            {"setTextTip", "Οριζει το κείμενο του λογοτύπου στην αναλογική εμφάνιση"},

            {"HourHandColor", "Χρώμα ωροδείκτη"},
            {"setHourHandColorTip", "Καθορίζει το χρώμα του ωροδείκτη"},

            {"MinuteHandColor", "Χρώμα λεπτοδείκτη"},
            {"setMinuteHandColorTip", "Καθορίζει το χρώμα του λεπτοδείκτη"},

            {"SweepHandColor", "Χρώμα δευτερολεπτοδείκτη"},
            {"setSweepHandColorTip", "Καθορίζει το χρώμα του δευτερολεπτοδείκτη"},

            {"FaceColor", "Χρώμα δίσκου ρολογιού"},
            {"setFaceColorTip", "Καθορίζει το χρώμα του δίσκου του ρολογιού"},

            {"CaseColor", "Χρώμα κυκλικού στεφανιού "},
            {"setCaseColorTip", "Καθορίζει το χρώμα του κυκλικου στεφανιού του ρολογιού"},

            {"TextColor", "Χρώμα κειμένου και ενδείξεων"},
            {"setTextColorTip", "Ορίζει το χρώμα του κειμένου και των ενδείξεων"},

            {"Foreground", "Χρώμα γραμμάτων"},
            {"setForegroundTip", "Ορίζει το χρώμα των γραμμάτων"},

            {"Border", "Περίγραμμα"},
            {"setBorderTip", "Ορίζει το περίγραμμα"},

            {"Font", "Γραμματοσειρά"},
            {"setFontTip", "Ορίζει τη γραμματοσειρά"},

            {"BorderPainted", "Περίγραμμα ενεργό"},
            {"setBorderPaintedTip", "Ορίζει την εμφάνιση ή απόκρυψη περιγράμματος"},

            {"Text", "Κείμενο"},
            {"setTextTip", "Ορίζει το κείμενο"},

            {"ToolTipText", "Κείμενο επεξήγησης"},
            {"setToolTipTextTip", "Ορίζει το κείμενο επεξήγησης"},

            {"ContentAreaFilled", "Διαφάνεια εσωτερικής περιοχής"},
            {"setContentAreaFilledTip", "Καθορίζει αν χρωματίζεται 'ή είναι διαφανής η εσωτερική περιοχή"},

            {"Icon", "Εικονίδιο"},
            {"setIconTip", "Ορίζει το εικονίδιο του κουμπιού"},

            {"SelectedIcon", "Εικονίδιο επιλογής κουμπιού"},
            {"setSelectedIconTip", "Ορίζει το εικονίδιο αν το κουμπί πατηθεί"},

            {"RolloverIcon", "Εικονίδιο έλευσης ποντικού"},
            {"setRolloverIconTip", "Ορίζει το εικονίδιο όταν περνά πανω από το κουμπί το ποντίκι "},

            {"RolloverSelectedIcon", "Εικονίδιο έλευσης - επιλογής"},
            {"setRolloverSelectedIconTip", "Ορίζει το εικονίδιο όταν το ποντίκι περνάει πάνω από το κουμπί και πατηθεί "},

            {"Selected", "Επιλογή κουμπιού"},
            {"setSelectedTip", "Ορίζει αν το κουμπί είναι επιλεγμένο ή όχι "},

            {"RolloverEnabled", "Απόκριση με διέλευση ποντικού"},
            {"setRolloverEnabledTip", "Ορίζει αν το κουμπί αντιδρά όταν περνά απο πάνω το ποντίκι "},

            {"VerticalAlignment", "Κάθετη ευθυγράμμιση"},
            {"setVerticalAlignmentTip", "Ορίζει την κάθετη ευθυγράμμιση "},

            {"VerticalTextPosition", "Κάθετη θέση κειμένου"},
            {"setVerticalTextPositionTip", "Ορίζει την κάθετη θέση κειμένου"},

            {"HorizontalTextPosition", "Οριζόντια θέση κειμένου"},
            {"setHorizontalTextPositionTip", "Ορίζει την οριζόντια θέση κειμένου"},

            {"HorizontalAlignment", "Οριζόντια ευθυγράμμιση"},
            {"setHorizontalAlignmentTip", "Ορίζει την οριζόντια ευθυγράμμιση"},

            {"FocusPainted", "Σχεδίαση εστίασης (focus paint)"},
            {"setFocusPaintedTip", "Καθορίζει αν σχεδιάζεται η εστίαση"},

            {"PressedIcon", "Εικονίδιο πατημένου κουμπιού"},
            {"setPressedIconTip", "Ορίζει το εικονίδιο του κουμπιού όταν αυτό πατηθεί "},

            {"Opaque", "Αδιαφάνεια"},
            {"setOpaqueTip", "Ορίζει αν το κουμπί είναι αδιαφανές"},

            {"Name", "Όνομα"},
            {"setNameTip", "Ορίζει το όνομα του κουμπιού "},

            {"DisabledIcon", "Εικονίδιο ανενεργού κουμπιού"},
            {"setDisabledIconTip", "Ορίζει το εικονίδιο όταν το κουμπί είναι ανενεργό "},

            {"DisabledSelectedIcon", "Εικονίδιο ανενεργής επιλογής"},
            {"setDisabledSelectedIconTip", "Ορίζει το εικονίδιο Ανενεργής Επιλογής "},

            {"AlignmentX", "Ευθυγράμμιση ως προς άξονα Χ"},
            {"setAlignmentXTip", "Ορίζει την ευθυγράμμιση ως προς άξονα Υ "},

            {"AlignmentY", "Ευθυγράμμιση ως προς άξονα Υ"},
            {"setAlignmentYTip", "Ορίζει την ευθυγράμμιση ως προς άξονα Υ"},

            {"DoubleBuffered", "Υπαρξη προσωρινης αποθήκευσης σχεδίασης (double buffered)"},
            {"setDoubleBufferedTip", "Ορίζει αν υπάρχει δυνατότητα προσωρινης αποθήκευσης της σχεδίασης"},

            {"Layout", "Επιλογή διάταξης χώρου"},
            {"setLayoutTip", "Ορίζει τον τρόπο διάταξης χώρου "},

            {"Margin", "Περιθώρια"},
            {"setMarginTip", "Ορίζει τα περιθώρια "},

            {"Enabled", "Ενεργό"},
            {"setEnabledTip", "Ορίζει αν το κουμπί είναι ενεργό"},

            //action Event
            {"ActionPerformed", "Πραγματοποίηση συμβάντος"},
            {"setActionPerformedTip", "Συνέβη κάποιο γεγονός..."},

            {"MousePressed", "Πάτημα ποντικού "},
            {"setMousePressedTip", "Το ποντίκι πατήθηκε εντός της ψηφίδας"},

            {"FocusGained", "Απόκτηση Εστίασης"},
            {"setFocusGainedTip", "Η εστίαση αποκτήθηκε για την ψηφίδα"},

            {"FocusLost", "Απώλεια Εστίασης"},
            {"setFocusLostTip", "Η εστίαση χάθηκε για την ψηφίδα"},

            {"MouseReleased", "Αποδέσμευση πλήκτρου ποντικού "},
            {"setMouseReleasedTip", "Το πλήκτρο του ποντικού αποδεσμεύτηκε"},

            {"MouseClicked", "Πάτημα - Αποδέυσμευση ποντικού"},
            {"setMouseClickedTip", "Το πλήκτρο του ποντικού πατήθηκε και αποδεσμεύτηκε"},

            {"componentHidden", "Απόκρυψη ψηφίδας"},
            {"setcomponentHiddenTip", "Η ψηφίδα γίνεται 'αόρατη'"},

            {"componentShown", "Εμφάνιση ψηφίδας"},
            {"setcomponentShownTip", "Η ψηφίδα γίνεται όρατή"},

            {"mouseEntered", "Έίσοδος ποντικού"},
            {"setmouseEnteredTip", "Το ποντίκι μπήκε στο χώρο που καταλαμβάνει η ψηφίδα"},

            {"mouseExited", "Έξοδος ποντικού"},
            {"setmouseExitedTip", "Το ποντίκι βγήκε από χώρο που καταλαμβάνει η ψηφίδα"},

            {"mouseMoved", "Κίνηση ποντικού"},
            {"setmouseMovedTip", "Το ποντίκι κινήθηκε"},

            {"propertyChange", "Αλλαγή ιδιότητας"},
            {"setpropertyChangeTip", "Κάποια ιδιότητα της ψηφίδας άλλαξε"},

            {"vetoableChange", "Επικύρωση αλλαγής ιδιότητας"},
            {"setvetoableChangeTip", "Επικυρώνεται η αλλαγή κάποιας ιδιότητας"},

            {"Time", "Ώρα"},
            {"setTimeTip", "Καθορισμός ώρας ρολογιού"},
            {"setDateTip", "Καθορισμός ημερομηνίας ρολογιού"},


            {"Month0", "Ιανουαρίου"},
            {"Month1", "Φεβρουαρίου"},
            {"Month2", "Μαρτίου"},
            {"Month3", "Απριλίου"},
            {"Month4", "Μαίου"},
            {"Month5", "Ιουνίου"},
            {"Month6", "Ιουλίου"},
            {"Month7", "Αυγούστου"},
            {"Month8", "Σεπτεμβρίου"},
            {"Month9", "Οκτωβρίου"},
            {"Month10", "Νοεμβρίου"},
            {"Month11", "Δεκεμβρίου"},
            {"left", "ΑΡΙΣΤΕΡΑ"},
            {"center", "ΣΤΟ ΚΕΝΤΡΟ"},
            {"right", "ΔΕΞΙΑ"},
            {"leading", "ΣΤΗΝ ΑΡΧΗ"},
            {"trailing", "ΣΤΟ ΤΕΛΟΣ"},

            {"top", "ΕΠΑΝΩ"},
            {"bottom", "ΚΑΤΩ"},

            {"ConstructorTimer", "Κατασκευή ρολογιού"},
            {"LoadTimer", "Ανάκτηση ρολογιού"},
            {"SaveTimer", "Αποθήκευση ρολογιού"},
            {"InitESlateAspectTimer", "Κατασκευή αβακιακής πλευράς ρολογιού"},

            {"PlugsUsed", "Χρήση Συνδέσμων"},
            {"setPlugsUsedTip", "Η ιδιότητα οριζει αν ειναι αναγκαία η χρήση συνδέσμων"},
        };

}
