package gr.cti.eslate.mapViewer;

import java.util.ListResourceBundle;

public class ToolbarTipBundle_el_GR extends ListResourceBundle {
	public Object [][] getContents() {
		return contents;
	}

	static final Object[][] contents={
		{"showMenu",    "Εμφάνιση λίστας ενεργειών"},
		{"navigate",    "Καθοδήγηση ενεργής οντότητας"},
		{"navigatehelp","Καθοδήγησε την ενεργή οντότητα με κλικ στο σημείο προορισμού."},
		{"pan",         "Κύληση του χάρτη"},
		{"panhelp",     "Σύρε το χάρτη προς κάποια κατεύθυνση."},
		{"activate",    "Καθορισμός ενεργού αντικειμένου"},
		{"activatehelp","Κάνε κλικ σε ένα αντικείμενο."},
		{"select",      "Επιλογή με παραλληλόγραμμο"},
		{"selectCircle","Επιλογή με κύκλο"},
		{"selecthelp",  "Όρισε με το ποντίκι μία περιοχή στο χάρτη."},
		{"selectcontrolhelp","Προσθήκη σε/Αφαίρεση από την τρέχουσα επιλογή."},
		{"rotate",      "Περιστροφή του χάρτη"},
		{"rotatehelp",  "Σύρε το ποντίκι προς τα αριστερά ή δεξιά για περιστροφή."},
		{"edit",        "Εισαγωγή αντικειμένου"},
		{"edithelp",    "Μπορείς να εισάγεις, να διαγράψεις ή να τροποποιήσεις αντικείμενα."},
		{"zoom",        "Μεγέθυνση/σμίκρυνση προβολής"},
		{"goIn",        "Μετάβαση σε άλλη περιοχή"},
		{"goInhelp",    "Κάνε κλικ σε κάποιο τετράγωνο."},
		{"goOut",       "Επιστροφή στην προηγούμενη περιοχή"},
		{"goOuthelp",   "Κάνε κλικ στο χάρτη για να επιστρέψεις στo"},
		{"browse",     "Επισκόπηση"},
		{"browsehelp",  "Κάνε κλίκ για επιλογή αντικειμένου ή/και σύρσιμο χάρτη"},
		{"meter",       "Μέτρηση αποστάσεων"},
		{"meterhelp",   "Σύρε το ποντίκι μεταξύ δύο σημείων."},
		{"grid",        "Προβολή/Απόκρυψη πλέγματος"},
		{"miniature",   "Προβολή σμίκρυνσης του χάρτη"},
		{"miniaturehelp","Σημειώνεται με κίτρινο η περιοχή προβολής."},
		{"identify",    "Αναγνώριση αντικειμένων"},
		{"identifyhelp","Δείξε με το ποντίκι το αντικείμενο που θέλεις να αναγνωρίσεις."},
		{"layerVisib",  "Προβολή/Απόκρυψη επιπέδων, εικόνων, μονοπατιών"},
		{"showhide",    "Προβολή/Απόκρυψη μη επιλεγμένων στοιχείων"},
		{"legend",      "Προβολή υπομνήματος χάρτη"},
		{"spot",        "Θέση της περιοχής στο χάρτη"},
		{"zoomRect",    "Μεγέθυνση συγκεκριμένης περιοχής (Σμίκρυνση με CTRL)"},
		{"zoomRecthelp","Όρισε με το ποντίκι μία περιοχή στο χάρτη για μεγέθυνση."},
		{"zoomRectcontrolhelp","Όρισε με το ποντίκι μία περιοχή στο χάρτη για σμίκρυνση."},
	};
}
