package gr.cti.eslate.planar;

import java.util.ListResourceBundle;

/**
 * @author      George Birbilis
 * @author      Angeliki Oikonomou
 * @author      Kriton Kyrimis"
 * @version     2.0.1, 23-Jan-2008
 */
public class MessagesBundle_el_GR extends ListResourceBundle {
    public Object [][] getContents() {
        return contents;
    }

    static final String[] info={"Τμήμα του περιβάλλοντος Αβάκιο (http://E-Slate.cti.gr)",
                                "Σχεδιαστική ιδέα: Χ. Κυνηγός",
                                "Ανάπτυξη: Γ. Μπιρμπίλης, Α. Οικονόμου, Κ.  Κυρίμης",
                                "Copyright Ερευνητικό Ακαδημαϊκό Ινστιτούτο Τεχνολογίας Υπολογιστών-ΕΑ.ΙΤΥ 1993-2008.",
                                "Ανάπτυξη τρέχουσας έκδοσης από τις Conceptum AE και ΕΧΟDUS AE.",
                                "Το Αβάκιο 2.0 υπόκειται σε διπλή άδεια (dual license), ήτοι ισχύουν οι όροι  της GNU-GPL License και της  L-GPL license.",
                                " ",
                                "Επιτρέπεται η παραγωγή, διανομή και εμπορική εκμετάλλευση κλειστού ή ανοιχτού κώδικα παράγωγων προϊόντων",
                                "βασισμένων στην πλατφόρμα Αβάκιο 2.0 και κάθε επόμενης έκδοσής της καθώς επίσης και να συμπεριλαμβάνεται",
                                "και να διανέμεται μαζί με τα προϊόντα αυτά η πλατφόρμα σε μορφή πηγαίου ή/και εκτελέσιμου κώδικα."
                                };

    static final Object[][] contents={
     {"info", info},
     //
     {"Planar", "Δισδιάστατος Μεταβολέας"},
     {"title",  "Ψηφίδα Δισδιάστατος Μεταβολέας, έκδοση "},
     {"Vector","Διάνυσμα"},
     {"From","Από"},
     {"To","Μέχρι"},
     //
     {"File","Αρχείο"},
     {"Edit","Επεξεργασία"}, //26-11-1998
//     {"Tool","Εργαλείο"},
     {"View","Προβολή"},
//     {"Settings","Ρυθμίσεις"},
     //////
     {"New",   "Νέο"},
     {"Open",  "Ανοιγμα"},
//     {"Close", "Κλείσιμο"},
//     {"Save",  "Αποθήκευση"},
     {"Print", "Εκτύπωση"},
     //////
     {"Cut",   "Αποκοπή"},
     {"Copy",  "Αντιγραφή"},
     {"Paste", "Επικόλληση"},
     {"Clear", "Καθαρισμός"},
     {"Select All", "Επιλογή όλων"},
     //
     {"Axis","Αξονες"},
     {"Grid","Πλέγμα"},
     {"Control Points","Σημεία ελέγχου"},
     {"Mapping","Απεικόνιση"},
     {"Cartesian","Καρτεσιανή"},
     {"Polar","Πολική"},
     {"Dots","Τελείες"},
     {"Lines","Γραμμές"}
  	};
}
