package gr.cti.eslate.eslateToolBar;

import java.util.*;

/**
 * Greek language localized strings for the toolbar component.
 *
 * @author      Kriton Kyrimis
 * @version     2.0.4, 23-Jan-2008
 * @see         gr.cti.eslate.eslateToolBar.ESlateToolBar
 */
public class ToolBarResource_el extends ListResourceBundle
{
  public Object[][] getContents()
  {
    return contents;
  }

  static final Object[][] contents = {
    //
    // component info
    //
    {"componentName", "Ψηφίδα Ράβδος Εργαλείων"},
    {"name", "Ράβδος εργαλείων"},
    {"credits1", "Τμήμα του περιβάλλοντος Αβάκιο (http://E-Slate.cti.gr)"},
    {"credits2", "Ανάπτυξη: Κ. Κυρίμης"},
    {"credits3", "Copyright Ερευνητικό Ακαδημαϊκό Ινστιτούτο Τεχνολογίας Υπολογιστών-ΕΑ.ΙΤΥ 1993-2008.\nΑνάπτυξη τρέχουσας έκδοσης από τις Conceptum AE και ΕΧΟDUS AE.\nΤο Αβάκιο 2.0 υπόκειται σε διπλή άδεια (dual license), ήτοι ισχύουν οι όροι  της GNU-GPL License και της  L-GPL license.\n\nΕπιτρέπεται η παραγωγή, διανομή και εμπορική εκμετάλλευση κλειστού ή ανοιχτού κώδικα παράγωγων προϊόντων\nβασισμένων στην πλατφόρμα Αβάκιο 2.0 και κάθε επόμενης έκδοσής της καθώς επίσης και να συμπεριλαμβάνεται\nκαι να διανέμεται μαζί με τα προϊόντα αυτά η πλατφόρμα σε μορφή πηγαίου ή/και εκτελέσιμου κώδικα."},
    {"version", "έκδοση"},
    //
    // Other text
    //
    {"group", "Ομάδα"},
    {"nullName", "Το όνομα δεν πρέπει να είναι null"},
    {"nullGroup", "Η ομάδα δεν πρέπει να είναι null"},
    {"nullComponent", "Το εργαλείο δεν πρέπει να είναι null"},
    {"groupExists", "Υπάρχει ήδη μια ομάδα με αυτό το όνομα"},
    {"foreignGroup", "Η ομάδα αυτή δεν ανήκει σ' αυτή τη ράβδο εργαλείων"},
    {"foreignTool", "Το εργαλείο αυτό δεν ανήκει σ' αυτή τη ράβδο εργαλείων"},
    {"badIndex", "Μη αποδεκτή θέση εργαλείου"},
    {"removeFromParent", "Αφαίρεση ράβδου εργαλείων"},
    {"confirm", "Επιβεβαίωση"},
    {"confirmRemove", "Η ράβδος εργαλείων έχει μεταβληθεί.\nΕίστε βέβαιοι όιτ θέλετε να την αφαιρέσετε;"},
    {"notice", "Ειδοποίηση"},
    {"noTopLevel", "Παρακαλώ χρησιμοποιήστε το Αβάκιο για να αφαιρέσετε ψηφίδες από αυτό"},
    {"noAddSeparator", "Μη χρησιμοποιείτε την ESlateToolbar.addSeparator. Αντ' αυτής, χρησιμοποιήστε οπτικές ομάδες."},
    {"nullTool", "Το εργαλείο δεν πρέπει να είναι null"},
    //
    // BeanInfo resources
    //
    {"orientation", "Προσανατολισμός"},
    {"orientationTip", "Ορίστε τον προσανατολισμό τής ράβδου εργαλείων"},
    {"horizontal", "Οριζόντια"},
    {"vertical", "Κατακόρυφη"},
    {"dynBorders", "Δυναμικά σχεδιαζόμενα περιγράμματα"},
    {"dynBordersTip", "Ορίστε αν τα περιγράμματα τών εργαλείων θα σχεδιάζονται δυναμικά"},
    {"border", "Περίγραμμα"},
    {"borderTip", "Ορίστε το περίγραμμα τής ράβδου εργαλείων"},
    {"separation", "Απόσταση μεταξή οπτικών ομάδων"},
    {"separationTip", "Ορίστε το διάστημα ανάμεσα σε διαδοχικές οπτικές ομάδες"},
    {"leadingSeparation", "Αρχική απόσταση"},
    {"leadingSeparationTip", "Ορίστε το διάστημα ανάμεσα στο πρώτο εργαλείο και την άκρη τής ράβδου"},
    {"mouseClickedOnTool", "Πάτημα/αποδέσμευση ποντικού σε εργαλείο"},
    {"mousePressedOnTool", "Πάτημα ποντικού σε εργαλείο"},
    {"mouseReleasedOnTool", "Αποδέσμευση πλήκτρου ποντικού σε εργαλείο"},
    {"mouseEnteredOnTool", "Είσοδος ποντικού σε εργαλείο"},
    {"mouseExitedOnTool", "Έξοδος πονικού από εργαλείο"},
    {"mouseDraggedOnTool", "Σύρσιμο ποντικού σε εργαλείο"},
    {"mouseMovedOnTool", "Μετακίνηση ποντικού σε εργαλείο"},
    {"actionPerformedOnTool", "Πραγματοποίηση συμβάντος σε εργαλείο"},
    {"vgLayout", "Διάταξη οπτικών ομάδων"},
    {"vgLayoutTip", "Τροποποιήστε τη διάταξη και τη σύνθεση τής ράβδου"},
    {"bgLayout", "Ομάδες κουμπιών"},
    {"bgLayoutTip", "Διαρρυθμίστε τις ομάδες αμοιβαίου αποκλεισμού κουμπιών τής ράβδου"},
    {"centered", "Κεντράρισμα"},
    {"centeredTip", "Ορίστε αν τα περιεχόμενα τής ράβδου θα είναι κεντραρισμένα"},
    {"borderPainted", "Σχεδιασμός περιγράμματος"},
    {"borderPaintedTip", "Ορίστε αν θα σχεδιάζεται το περίγραμμα τής ράβδου"},
    {"floatable", "Κινητή"},
    {"floatableTip", "Ορίστε αν η ράβδος μπορεί να συρθεί σε άλλη θέση"},
    {"preferredSize", "Προτιμώμενο μέγεθος"},
    {"preferredSizeTip", "Ορίστε το προτιμώμενο μέγεθος τής ράβδου"},
    {"minimumSize", "Ελάχιστο μέγεθος"},
    {"minimumSizeTip", "Ορίστε το ελάχιστο μέγεθος τής ράβδου"},
    {"maximumSize", "Μέγιστο μέγεθος"},
    {"maximumSizeTip", "Ορίστε το μέγιστο μέγεθος τής ράβδου"},
    {"modified", "Τροποποιημένη"},
    {"modifiedTip", "Ορίστε αν η ράβδος έχει τροποποιηθεί από τη σταθερή της κατάσταση"},
    {"menuEnabled", "Μενού ράβδου ενεργό"},
    {"menuEnabledTip", "Ορίστε αν θα εμφανίζεται μενού με δεξί κλικ σε αχρησιμοποίητο χώρο"},
    //
    // Performance manager resources
    //
    {"ConstructorTimer",      "Κατασκευή ράβδου εργαλείων"},
    {"LoadTimer",             "Ανάκτηση ράβδου εργαλείων"},
    {"SaveTimer",             "Αποθήκευση ράβδου εργαλείων"},
    {"InitESlateAspectTimer", "Κατασκευή αβακιακής πλευράς ράβδου εργαλείων"},
  };
}
